{"reviewerID": "AQTREEANSNEEH", "asin": "B0023B1364", "reviewerName": "HRW4", "helpful": [1, 1], "reviewText": "I've always wanted a bluetooth speaker for the house but never could find one that was just right.This product works very well. Sound is clear, range is great and volume is pretty solid.Paired with my phone and computer easily enough, though I did run into issues with the laptop using a generic bluetooth receiver. When the drivers auto installed after pairing, it set the speaker to a mono device. After I set the laptop to register the speaker as a stereo capable device, everything was a million times better.The speaker isn't tiny, but it's not too large either. So far battery life is great as well. No complaints.", "overall": 5.0, "summary": "Excellent product for the cost", "unixReviewTime": 1347840000, "reviewTime": "09 17, 2012"}
{"reviewerID": "AQ3IN3MRXQ5KH", "asin": "B0023B1364", "reviewerName": "IlPrimitivo", "helpful": [2, 3], "reviewText": "New out of the box and the speaker pops and snaps and crackles with every beat of the song.  Too bad I was playing a violin sonata by Debussy.  When I listen to a song I want to hear the music not the hiss of poor received signal or the rattle of loose and broken parts.I knew that at the low price of the speaker that I should not expect much but I did not expect for the speaker to be of such poor quality.PRO: Bluetooth connectivity worked.  Came with batteries.CONS: Loud beeps every time a button is pressed.  Speaker is unusable due to all the noise it makes.Cannot recommend.", "overall": 2.0, "summary": "Dissapointing", "unixReviewTime": 1389571200, "reviewTime": "01 13, 2014"}
{"reviewerID": "A2TW7DLAOEO5Y", "asin": "B0023B1364", "reviewerName": "Indiana Girl \"Colts Fan\"", "helpful": [1, 1], "reviewText": "I got this as a daily special.  I plan to use it for our family gift exchange next Christmas.  I feel that I got great value for the $$ spent.", "overall": 5.0, "summary": "Good value", "unixReviewTime": 1389744000, "reviewTime": "01 15, 2014"}
{"reviewerID": "A1FSADFCX1DI2D", "asin": "B0023B1364", "reviewerName": "ITguy4U \"ITGuy4U\"", "helpful": [1, 1], "reviewText": "Materials are very cheap. Plastic face was scuffed when arrived. Sound quality was just OKNot recommended for my tastes.", "overall": 3.0, "summary": "Cheap but works OK", "unixReviewTime": 1395619200, "reviewTime": "03 24, 2014"}
{"reviewerID": "AYQXTLJN50SZ9", "asin": "B0023B1364", "reviewerName": "James Pierce", "helpful": [0, 0], "reviewText": "I purchased this item specifically to use by the potentially disastrous environment of the hot tub. I had previously used wired speakers with my iPhone but was always worried about ruining the phone around the water. This speaker allows me to keep the phone at a safe distance while still being able to control volume, skip tracks, etc...... At this price, a ruined speaker is not going to break the bank. Sound quality and volume are fine for my use. The Bluetooth paired easily.", "overall": 5.0, "summary": "Nice little speaker", "unixReviewTime": 1324684800, "reviewTime": "12 24, 2011"}
{"reviewerID": "A2S2MQUJVPUPEU", "asin": "B0023B1364", "reviewerName": "Jason Statham \"The Transporter\"", "helpful": [55, 67], "reviewText": "Lets be honest, the need for devices to compress(degrade) the music before sending it over bluetooth to a speaker inherently makes any speaker sound underwhelming. This speaker is no different. Use this speaker with a wire(3.5 mm) and it sounds great. Use it via Bluetooth with a great high bitrate mp3 and it sounds good. Use it to stream Slacker/Pandora via your mobile(already compressed to send to your phone) via bluetooth and it sound HORRIBLE . After owning 8 different speakers, i have come to the conclusion that as long as your expectations are realistic,you can be less critical. Only the Motorola EQ7 has impressed me in all areas. Yet that was 150$ brand new 3 years ago. This is a 50$ speaker. So i grade it as a 50$ speaker. Pound for pound it earns its 5 stars. Why do you ask? First is battery life,with 4 Power Ex AA batteries it gives me 8 to 10 hours at its highest volumes...perfect for a day at work or the beach. Second is durability, i have dropped it 7 times on hard concrete floors..batteries popped out cover went flying and it has not cracked or missed a beat.Third is its size a shape, It slides in to any pocket i have,my side pocket in my car and while not being tiny it is convenient when moving to place to place. 4th and finally is value/price at 50 dollars it is a great value it takes rechargeable batteries so i keep 4 in reserve and it takes A/C power too. I am not wealthy, yet if i lost it or it broke I would not be devastated(unlike my EQ7 which would have killed me even before it was discontinued) because 50$ is a price point I can deal with. So as far as I am concerned I highly recommend this speaker and use it EVERYDAY with great results.", "overall": 5.0, "summary": "Nice Sounding, Well Shaped Bluetooth Speaker", "unixReviewTime": 1353196800, "reviewTime": "11 18, 2012"}
{"reviewerID": "A19Y2T6ACQXTUU", "asin": "B0023B1364", "reviewerName": "jeremy", "helpful": [1, 1], "reviewText": "i ordered 2 bluetooth speakers and this one ACTUALLY worked fine! i use this speaker in the bathroom while taking a shower while my 4s is in the kitchen.. i can FINALLLY listen to Howard via my sirius/xm account,, or my ipod! great speaker over all. its very loud as well.. good stuff", "overall": 5.0, "summary": "finally!", "unixReviewTime": 1325376000, "reviewTime": "01 1, 2012"}
{"reviewerID": "A21YQTAQRSGPNN", "asin": "B0023B1364", "reviewerName": "J Johnson", "helpful": [0, 0], "reviewText": "It does what it says it does, its not super impressive, I've only used it a handful of times since I bought it.", "overall": 3.0, "summary": "Alright", "unixReviewTime": 1382572800, "reviewTime": "10 24, 2013"}
{"reviewerID": "A2O0IF8E4RM78C", "asin": "B0023B1364", "reviewerName": "JUDITHKAIDA", "helpful": [1, 1], "reviewText": "I AM VERY PLEASED WITH THIS SPRACHT SPEAKER.....IT WAS RECOMMENDED BY A FRIEND.....WHEN VISITING MY DAUGHTER WHO IS A MATH TEACHER.....SHE SAID THAT WOULD BE GREAT FOR HER CLASS ROOM.....SO I GAVE HER MINE AND ORDERED ANOTHER ONE.", "overall": 5.0, "summary": "SPRACHT PORTABLE SPEAKER", "unixReviewTime": 1381708800, "reviewTime": "10 14, 2013"}
{"reviewerID": "A2LYEP086U3D06", "asin": "B0023B1364", "reviewerName": "Kyle C. Douglas \"Kyle\"", "helpful": [1, 1], "reviewText": "It's not a Bose, but it does exactly what it is advertised to do.  I actually keep this in my laptop bag, and it travels with me to my office, or to one of our other field offices.  I use it to stream music from my iPhone or iPad.  I've also used the phone feature on it, which works well, but I've had complaints of the microphone cutting out.  I've also used a standard 3.5mm speaker wire to connect it to my laptop (which has crappy built in speakers) while watching movies on the road.  It's proven it's value over and over again.  The sound quality is good for everyday listening.  I bought one, my wife liked it, so I bought a second one so we'd each have one.  Worth the money to have on hand.", "overall": 4.0, "summary": "Excellent value for what it does", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
{"reviewerID": "A336PDROMWEDWL", "asin": "B0023B1364", "reviewerName": "LittleEyes", "helpful": [1, 1], "reviewText": "This has great sound for such a little device! I bought this as a Lightning Deal for an amazing price.I was skeptical at first, but when my husband started playing music on it, I was shocked. The bluetooth recognized & paired with his phone fairly quickly, and the sound is just amazing! We haven't tested the connection from far away just yet, but we don't ever plan on using it when the phone is too far. Also interesting is that since its BlueTooth you can project your phone calls through it too. We found that out by accident.", "overall": 5.0, "summary": "Great sound !", "unixReviewTime": 1361491200, "reviewTime": "02 22, 2013"}
{"reviewerID": "A1G3CK12TKTXRA", "asin": "B0023B1364", "reviewerName": "L. J. Williams \"Technogeek\"", "helpful": [0, 0], "reviewText": "This is an excellent little gadget.  It's no Bose speaker, but the sound has good quality (excellent for the price), is quite loud and really clear for a wireless speaker.  I use it to channel internet radio from my iPhone in the kitchen and dining rooms and it reliably fills the room with crisp, clear sound with no defects from about 20 feet if my iPhone has an unobstructed view - half that from my pocket.The unit pairs easily, is a great size with a curved shape and a high-quality weight to it with the batteries installed.  The unit comes with a plug, but accepts 4 AA batteries.  Even full of batteries, it goes to sleep if you disconnect it from wall power.  I would've liked it to be able to &#34;switch&#34; to battery mode instantaneously and keep it moving, but you have to restart it manually.  Still, the batteries mean we get open-air internet radio or MP3 music at the park or wherever.The phone speaker feature is a real bonus.  An interesting side effect is that, while the microphone is good, it's easy to forget that the other party cannot hear you if you are more than a reasonable distance away from the microphone.  It's not a flaw because I'd never have a conversation with a real person or even a Polycom from that distance, but the speaker is so powerful that it makes you want to respond in your normal voice (which doesn't help the caller).Another non-flaw is that you can only pair one device at a time.  The paired device has to disconnect before another device can use it.  This is no different than if you had a wired connection, but is mildly irritating that I have to manually disconnect my phone or iPad before my wife can use it.", "overall": 5.0, "summary": "Perfect speaker at a perfect price does everything I need it to do.", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}
{"reviewerID": "A2382RNNECQ38V", "asin": "B0023B1364", "reviewerName": "Marek Podgorny", "helpful": [0, 0], "reviewText": "The speaker connects to audio sources pretty well. Controls are a bit confusing but acceptable. Audio quality though has nothing to do with manufacturers claims: it is a small speaker with average audio, meaning it is only usable to voice applications such as Skype or other VTC apps. It is not suitable for music playback.", "overall": 3.0, "summary": "Overblown sound quality claims", "unixReviewTime": 1390262400, "reviewTime": "01 21, 2014"}
{"reviewerID": "A3L1AP4MXTYWHB", "asin": "B0023B1364", "reviewerName": "MA Stewart \"output555\"", "helpful": [0, 0], "reviewText": "The Spracht AURA BluNote Bluetooth speaker originally sold for $130 which is an absurd price considering its cheap build quality and barely acceptable sound quality. I purchased mine for about 60% less than that and still feel this speaker is an inferior value. The sound is simply too poor to make this suitable for any sort of serious music listening. No dynamic range or anything resembling bass. And forget about playing it loud. When a company releases a product this poor it makes me question it as a whole. Pass on Spracht and spend your money on brand that shows concern for product quality.", "overall": 2.0, "summary": "Not worth the reduced price", "unixReviewTime": 1348099200, "reviewTime": "09 20, 2012"}
{"reviewerID": "A149RNR5RH19YY", "asin": "B0023B1364", "reviewerName": "matt.mingkee", "helpful": [4, 6], "reviewText": "I purchased this speaker because I want to have wireless speakers for my nexus one. Actually, I puchased Yubz MAGNUM and this unit.Both use 4 AA battery, I soon realized this speaker does not support AVRCP, as well as you have to connect from the host (a big hassle). I connect it as \"wireless headphones\" not \"handsfree\".The volume and bass control are reset once you have battery replaced, which is another hassle.Now I say the good side: the sound is pretty decent. The speaker has bass boost and stereo widening, the former does really work.I never use handsfree speaker, so I can't give comments.If you want to use it as wireless audio speakers and you want to control from the speaker, you should go elsewhere.", "overall": 3.0, "summary": "great sound, but AVRCP is missing", "unixReviewTime": 1284163200, "reviewTime": "09 11, 2010"}
{"reviewerID": "A2EEB8BED78FCT", "asin": "B0023B1364", "reviewerName": "McEwen", "helpful": [0, 1], "reviewText": "first of all, it sounds like crappy little cheap speakers, which is basically what I was expecting so I can't complain about that. The bluetooth seems to work fine but I really only get about 20-25 feet if it is a clear line of sight, even if I walk between my phone and the speaker it will cut out. There are also a few things about it that really annoy me. When you power the speaker on the volume is set so low be default that you cannot even hear sound coming from it, even if my cell phone is turned all the way up. Once you get the volume at a decent level everything is great until you go to turn the speaker off it plays this cheesy chiming noise at the an outrageous volume level because that his how loud I had to turn up the speaker to be able to hear them. My initial solution was to just leave the speaker turned on and only turn on my bluetooth to connect when I want to listen to music, however there is a flashing blue light on the front which lights up our entire basement when it flashes every 10 seconds. We just covered up the light, but if it wasn't for the weird volume issues this wouldn't be a problem to begin with.", "overall": 3.0, "summary": "couple of really annoying features", "unixReviewTime": 1325030400, "reviewTime": "12 28, 2011"}
{"reviewerID": "A1QXE7OX7MSL2H", "asin": "B0023B1364", "reviewerName": "M. Gondek \"cenmad\"", "helpful": [10, 12], "reviewText": "After a couple months of use, I'm editing my review to take away one star.  All the below holds true, but the blue light is actually incredibly annoying.  It flashes quickly and randomly as long as the unit is turned on, so I end up hiding the speaker out of my line of sight.  It's a serious design flaw in a speaker that's obviously trying to be sleek, modern, and easy to fit into your decor.----I bought this little speaker to use with my Nexus One, which holds about 12G of my music collection.  The convenience of the Bluetooth connection and the small footprint sold me on this model, and it does not disappoint.Pros:1.  Setup was seamless and took a total of 45 seconds, thirty of which was waiting for my phone's Bluetooth to recognize the speaker.2.  Size matters for a portable speaker, and this one has a small footprint. The slight curve makes it stable enough to not worry about tipping, but it takes up less desk space than my 5x7 digital photo frame.3.  Design is good, with a nice sleek appearance.  The buttons have a good, solid feel, and they're nicely sized so there's no hunting around.4.  The sound is also very good, but no one is going to mistake it for a full-size speaker.5.  The unit comes with an AC adapter, four AA batteries, and an Aux-in cable.  Everything I needed to get my Nexus One and iPod both connected in no time.Cons:1.  The sound does have some sibilance, particularly on high notes.  It's not really a tinny sound - much better than most other portable speakers of this size that I've tried.  That said, it's not going to blow you away with sound quality.2.  The blue lights on the front of the unit (not shown in the pictures) are, well, ugly and distracting.  Where the photo shows three connecting black circles, the unit has blue circular lights when turned on.  Only the top circle is lit most of the time, but it's pretty bright.  Definitely not a design enhancement, and a downright annoyance if you want to sleep with this thing going.Overall, I'm very happy with this speaker and am glad to have it.  The complete ease of connecting my devices, the size and portability, and the decent sound quality outweigh the negatives for me.  And since I bought it at the Goldbox price, I'd say it was worth the money.  Not sure I'd be as happy if I'd paid the regular price, though!", "overall": 3.0, "summary": "Works perfectly, good sound, very mobile *edited*", "unixReviewTime": 1295481600, "reviewTime": "01 20, 2011"}
{"reviewerID": "A1DH23ZEPK0QDE", "asin": "B0023B1364", "reviewerName": "RH", "helpful": [2, 3], "reviewText": "I had no trouble pairing this with my DROID X mobile phone and playing music through it at a reasonably high volume - the sound quality is what it is for this size speaker, but that's not what I bought it for. I bought this to use as a speakerphone and in that regard, it falls a bit short. The speaker volume is WAY down and not as clear as it should be - I have a Motorola speaker/speakerphone that's about a third the size of this and it works much better. I do like the fact that it uses 4 AA batteries instead of a built-in rechargeable battery that inevitably is dead when you want to use the speaker.", "overall": 3.0, "summary": "Not very suitable as a speakerphone", "unixReviewTime": 1321660800, "reviewTime": "11 19, 2011"}
{"reviewerID": "A16CILY68PYM3T", "asin": "B0023B1364", "reviewerName": "Sam", "helpful": [1, 1], "reviewText": "this is a great product. the sound is terrific, light weight, works wirelessly, so you don't need it to mount into the machine to play, good price, no complaints. small with big sound", "overall": 5.0, "summary": "awesome", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "ALV1J4KEXAGIO", "asin": "B0023B1364", "reviewerName": "Sir Michael \"cruising and musing\"", "helpful": [1, 3], "reviewText": "I heard the BOSE version of this style product but could not afford $300, so tried this $50 version.1st: the battery cover is flimsy: it was difficult to snap on and I was afraid I was going to break it.2nd: the stream was horrible. Maybe I got a lemon, but every 2 or three seconds the sound would stop and then start again... very irritating.3rd: the blinking blue night is also a huge irritation! Stop the blinking and make it steady.------------------My wallet said, &#34;SPRACHT!!!&#34; when it coughed up the dough for this toy.", "overall": 1.0, "summary": "sound fluttered", "unixReviewTime": 1353456000, "reviewTime": "11 21, 2012"}
{"reviewerID": "A3SO1S0PUC9DVQ", "asin": "B0023D4ZQC", "reviewerName": "Antman74", "helpful": [5, 7], "reviewText": "The picture does this little guy no justice. It's pretty small, however load and very easy to use and set up. The one thing I do have to complain about is the lack of instructions lol. Just in case it happens to you just press and hold the hang up button till the lights flash blue and red. Turn on your phone's bluetooth once you hear the beep and it stops flashing you are good to go. This one even rings when you get a call. I got this for my S3. Little did I know that the S voice works through the device. That was very cool and made working with that feature even easier.", "overall": 4.0, "summary": "I am now hands free.", "unixReviewTime": 1341964800, "reviewTime": "07 11, 2012"}